const { cmd } = require("../command");

cmd({
  pattern: "repo",
  alias: ["script", "github", "sc"],
  desc: "Show MUZAMMIL_MD GitHub repository info in a stylish format",
  category: "info",
  react: "⚡",
  filename: __filename
}, async (conn, m, store, { from }) => {

  const repoInfo = `
*╭─────────────────────◆*
*│* 🔥 *𝘽𝙊𝙏 𝙉𝘼𝙈𝙀:*
*│* > 𝙈𝙐𝙕𝘼𝙈𝙈𝙄𝙇_𝙈𝘿 🤖
*│*
*│* 👑 *𝙊𝙒𝙉𝙀𝙍:*
*│* > 𝙈𝙐𝙕𝘼𝙈𝙈𝙄𝙇 💻
*│*
*│* 🌟 *𝙎𝙏𝘼𝙍𝙎:*
*│* > ⭐ 𝙆𝙚𝙚𝙥 𝙎𝙪𝙥𝙥𝙤𝙧𝙩𝙞𝙣𝙜!
*│*
*│* 🍴 *𝙁𝙊𝙍𝙆𝙎:*
*│* > 🖲️ 𝘿𝙤𝙣’𝙩 𝙁𝙤𝙧𝙜𝙚𝙩!
*│*
*│* 🌐 *𝙂𝙄𝙏𝙃𝙐𝘽:*
*│* > https://github.com/muzii-523/MUZAMMILMD-
*│*
*│* 📝 *𝘿𝙀𝙎𝘾𝙍𝙄𝙋𝙏𝙄𝙊𝙉:*
*│* > ⚙️ 𝘽𝙚𝙨𝙩 𝙒𝙝𝙖𝙩𝙨𝘼𝙥𝙥 𝘽𝙤𝙩 𝙬𝙞𝙩𝙝 𝙋𝙤𝙬𝙚𝙧𝙛𝙪𝙡 𝙁𝙚𝙖𝙩𝙪𝙧𝙚𝙨!
*╰─────────────────────◆*

*💠 𝘿𝙤𝙣’𝙩 𝙁𝙤𝙧𝙜𝙚𝙩 𝙩𝙤 𝙎𝙩𝙖𝙧 & 𝙁𝙤𝙧𝙠 𝙍𝙚𝙥𝙤 💠*

> *𝙿𝙾𝚆𝙴𝚁𝙳 𝙱𝚈 𝙼𝚄𝚉𝙰𝙼𝙼𝙸𝙻_𝙼𝙳 ⚡*
`;

  await conn.sendMessage(from, {
    image: { url: "https://files.catbox.moe/cdkdtr.jpg" },
    caption: repoInfo,
    footer: "𝙶𝚁𝙾𝚄𝙿 𝙹𝙸𝙳: 120363403831162407@newsletter",
    headerType: 4
  }, { quoted: m });
});